# identity-shared - staging
### Terraform Format and Style 🖌 `success`
### Terraform Initialization ⚙️ `success`
### Terraform Validation 🤖 `success`
### Terraform Plan 📖 `success`
<details><summary>Show Plan</summary>
```terraform

module.common_resources.module.kafka_topic.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.database.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.module.kafka_topic.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=upstash_kafka_cluster_id]
module.common_resources.module.kafka_topic.upstash_kafka_topic.default: Refreshing state... [id=upstash-kafka-topic-2e9ee033-960b-42ea-9b1e-fdd860f7ed0e]
module.common_resources.module.database.cockroach_database.default: Refreshing state... [id=76a86c11-edab-4258-80c0-cd0733b1acdf:identity]
module.common_resources.module.database_migration_user.data.aws_ssm_parameter.cluster_id: Reading...
module.common_resources.module.database_migration_user.random_password.password: Refreshing state... [id=none]
module.common_resources.module.database_migration_user.data.aws_ssm_parameter.cluster_id: Read complete after 0s [id=cockroachdb_serverless_cluster_id]
module.common_resources.module.database_migration_user.cockroach_sql_user.default: Refreshing state... [id=76a86c11-edab-4258-80c0-cd0733b1acdf:identity_database_migration]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.common_resources.module.database_migration_user.data.cockroach_connection_string.default will be read during apply
  # (config refers to values not yet known)
 <= data "cockroach_connection_string" "default" {
      + connection_params = (known after apply)
      + connection_string = (known after apply)
      + database          = "identity"
      + id                = (sensitive value)
      + os                = (known after apply)
      + password          = (sensitive value)
      + sql_user          = "identity_database_migration"
    }

  # module.common_resources.module.database_migration_user.cockroach_sql_user.default will be updated in-place
  ~ resource "cockroach_sql_user" "default" {
        id         = "76a86c11-edab-4258-80c0-cd0733b1acdf:identity_database_migration"
        name       = "identity_database_migration"
      ~ password   = (sensitive value)
        # (1 unchanged attribute hidden)
    }

  # module.common_resources.module.database_migration_user.random_password.password must be replaced
-/+ resource "random_password" "password" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "random_seed" = "a710fb49-57cd-45cf-aaa7-a24ae7ec86dc" -> "df834d4c-6d7b-42ff-ab14-23493f2dd997"
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

  # module.common_resources.module.kafka_topic.upstash_kafka_topic.default must be replaced
-/+ resource "upstash_kafka_topic" "default" {
      ~ creation_time    = 1684053580 -> (known after apply)
      ~ id               = "upstash-kafka-topic-2e9ee033-960b-42ea-9b1e-fdd860f7ed0e" -> (known after apply)
      ~ multizone        = false -> (known after apply)
      ~ password         = (sensitive value)
      ~ region           = "us-east-1" -> (known after apply)
      ~ rest_endpoint    = "usable-gnat-9449-us1-rest-kafka.upstash.io" -> (known after apply)
      ~ state            = "active" -> (known after apply)
      ~ tcp_endpoint     = "usable-gnat-9449-us1-kafka.upstash.io" -> (known after apply)
      ~ topic_id         = "2e9ee033-960b-42ea-9b1e-fdd860f7ed0e" -> (known after apply)
      ~ topic_name       = "identity.v1" -> "identity.v1.event" # forces replacement
      ~ username         = "dXNhYmxlLWduYXQtOTQ0OSQD8UqvbM2lTymf51wpyYc7YUWG5zVhss0MKd-uQhU" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ database_migration_user_connection_string = (sensitive value)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```
</details>
*Pushed by: @mortezaalizadeh, Action: `pull_request`*